app/controllers/questions_controller.rb

  def create
    @question = Question.new(params_question)
    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "a long enough title"], ["content", "also long content"], ["created_at", "2015-05-26 01:07:20.589911"], ["updated_at", "2015-05-26 01:07:20.589911"]]

  def update
    @question = Question.find(params[:id])
    @question.update(params_question)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "questions" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["title", "New Title"], ["content", "New Body"], ["updated_at", "2015-05-26 01:07:21.200602"], ["id", 9]]

  def destroy
    question = Question.find(params[:id])
    question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 6]]